app/controllers/acts_controller.rb

SELECT * FROM "acts" WHERE ("acts"."id" = 1)
SELECT * FROM "games" WHERE ("games"."id" = 9)
SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    @act = Act.find(params[:id])
    @game = Game.find(params[:game_id])
    @act_owner = User.find(@act.user)