app/controllers/card_states_controller.rb

SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "card_states" WHERE ("card_states".deck_id = 2) ORDER BY position
INSERT INTO "acts" ("position", "created_at", "updated_at", "card_state_id", "user_id", "act_type", "game_id") VALUES(12, '2010-08-12 20:33:04', '2010-08-12 20:33:04', 3, 1, 'play_from_hand', 1)
---
  def play
    @game = Game.find(params[:game_id])
    card = CardState.find(params[:id])
    @act = Act.new(:card_state => card, :game => @game, :user => @user, :act_type => 'play_from_hand', :position => @game.next_act_position)
    @act.save

SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "card_states" WHERE ("card_states"."id" = 4)
---
  def give
    @game = Game.find(params[:game_id])
    @card = CardState.find(params[:id])