app/controllers/cards_controller.rb

  def new
    @tpl = Template.find(params[:template_id])
---
SELECT * FROM "templates" WHERE ("templates"."id" = 4)

  def create
    @tpl = Template.find(params[:template_id])
    cards = params[:card][:text].split(';') # separate by semi-colons
    cards.each {|c| c.strip!} #strip leading and trailing whitespace
    cards.delete("") # delete if it's blank
    cards.each do |c|
      new_card = Card.new(:text => c)
      new_card.template = @tpl
      new_card.save
---
SELECT * FROM "templates" WHERE ("templates"."id" = 4)
INSERT INTO "cards" ("template_id", "text", "deck_id") VALUES(1, 'this is a very long card this is a very long card this is a very long cardthis is a very long cardthis is a very long card this is a very long card this is a very long card this is a very long card this is a very long card this is a very long card', NULL)