app/controllers/decks_controller.rb

  def update
    @deck = Deck.find(params[:id])
    @game = Game.find(params[:game_id])
---
SELECT * FROM "decks" WHERE ("decks"."id" = 1)
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def draw
    @deck = Deck.find(params[:id])
    @game = Game.find(params[:game_id])
    drawn_card = @deck.availables[0]
    @deck.availables.delete(drawn_card)
    if(params[:hand] == '1')
      @draw = Draw.new(:card => drawn_card, :game => @game, :user => @user)
      @draw.save
      hand_card = CardInHand.new(:deck => @deck, :card => drawn_card, :user => @user)
      hand_card.save
    else
      @play = Play.new(:card => drawn_card, :game => @game, :user => @user)
      @play.save
      discard = DiscardedCard.new(:deck => @deck, :card => drawn_card, :position => DiscardedCard.find_new_position(@deck))
      @deck.discarded_cards << discard
    end
    if @deck.availables.empty?
      shuffle(@deck)
    else
      @deck.save
      @deck.available_cards.each do |a|
---
SELECT * FROM "decks" WHERE ("decks".game_id = 9) LIMIT 1
SELECT * FROM "games" WHERE ("games"."id" = 1)
INSERT INTO "draws" ("created_at", "card_id", "updated_at", "user_id", "game_id") VALUES('2010-07-22 21:29:11', 1, '2010-07-22 21:29:11', 1, 1)
INSERT INTO "card_in_hands" ("card_id", "user_id", "deck_id") VALUES(25, 1, 1)
INSERT INTO "plays" ("created_at", "card_id", "updated_at", "user_id", "game_id") VALUES('2010-07-22 22:04:47', 23, '2010-07-22 22:04:47', 1, 1)
SELECT * FROM "cards" WHERE ("cards"."id" = 1)
SELECT * FROM "discarded_cards" WHERE ("discarded_cards"."deck_id" = 1) ORDER BY position DESC LIMIT 1
INSERT INTO "discarded_cards" ("position", "card_id", "deck_id") VALUES(0, 1, 1)
SELECT * FROM "available_cards" WHERE ("available_cards".deck_id = 1) ORDER BY position

  def play
    @deck = Deck.find(params[:id])
    @game = Game.find(params[:game_id])
    @card = Card.find(params[:card_id])
    @play = Play.new(:card => @card, :game => @game, :user => @user)
    @play.save
    discard = DiscardedCard.new(:deck => @deck, :card => @card, :position => DiscardedCard.find_new_position(@deck))
    @deck.discarded_cards << discard
---
SELECT * FROM "decks" WHERE ("decks"."id" = 1)
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "cards" WHERE ("cards"."id" = 25)
INSERT INTO "plays" ("created_at", "card_id", "updated_at", "user_id", "game_id") VALUES('2010-07-22 21:53:39', 25, '2010-07-22 21:53:39', 1, 1)
SELECT * FROM "discarded_cards" WHERE ("discarded_cards"."deck_id" = 1) ORDER BY position DESC LIMIT 1
INSERT INTO "discarded_cards" ("position", "card_id", "deck_id") VALUES(0, 25, 1)