app/controllers/decks_controller.rb

INSERT INTO "acts" ("position", "created_at", "updated_at", "card_state_id", "user_id", "act_type", "game_id") VALUES(0, '2010-08-04 23:04:45', '2010-08-04 23:04:45', 61, 1, 'draw_to_hand', 9)
---
  def draw
    @deck = Deck.find(params[:id])
    @game = Game.find(params[:game_id])
    drawn_card = @deck.first_card
    @act = Act.new(:card_state => drawn_card, :game => @game, :user => @user, :act_type => params[:act], :position => @game.next_act_position)
    @act.save

SELECT * FROM "decks" WHERE ("decks"."id" = 3)
SELECT * FROM "games" WHERE ("games"."id" = 3)
DELETE FROM "decks" WHERE "id" = 3
---
  def destroy
    @deck = Deck.find(params[:id])
    @game = Game.find(params[:game_id])
    @deck.destroy