app/controllers/draws_controller.rb

  def show
    @draw = Draw.find(params[:id])
    @game = Game.find(params[:game_id])
    @draw_owner = User.find(@draw.user)
---
SELECT * FROM "draws" WHERE ("draws"."id" = 1)
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)