app/controllers/games_controller.rb

  def show
    @game = Game.find(params[:id])
    @deck = @game.deck
    @current_players = @game.players.to_a
    @current_players << @game.host
    @available_players = User.find(:all) - @current_players
    @discarded = @deck.discarded_cards
    @available = @deck.available_cards
    if(@host)
      @draws = Draw.find_all_by_game_id(@game, :order => 'id DESC')
    else
      @draws = Draw.find_all_by_game_id_and_user_id(@game, @user, :order => 'id DESC')
    end
    @plays = Play.find_all_by_game_id(@game, :order => 'id DESC')
    @hand = @user.card_in_hands.find_all {|card| card.deck.game == @game}
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "decks" WHERE ("decks".game_id = 1) LIMIT 1
SELECT * FROM "games" LIMIT 1
SELECT * FROM "plays" WHERE ("plays"."game_id" = 1) ORDER BY id DESC
INSERT INTO "decks" ("created_at", "updated_at", "game_id") VALUES('2010-08-04 00:02:30', '2010-08-04 00:02:30', NULL)
INSERT INTO "players_games" ("user_id", "game_id") VALUES (1, 1)
SELECT * FROM "plays" WHERE ("plays"."user_id" = 1 AND "plays"."game_id" = 1) ORDER BY id DESC
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "draws" WHERE ("draws"."game_id" = 1) ORDER BY id DESC
SELECT * FROM "draws" WHERE ("draws"."user_id" IS NULL AND "draws"."game_id" = 1) ORDER BY id DESC
SELECT * FROM "available_cards" WHERE ("available_cards".deck_id = 1) ORDER BY position
SELECT * FROM "card_in_hands" WHERE ("card_in_hands".user_id = 1)
SELECT * FROM "cards" WHERE ("cards".template_id = 1)
SELECT * FROM "discarded_cards" WHERE ("discarded_cards".deck_id = 1) ORDER BY position

  def add_player
    @player = User.find(params[:new_player])
    @game = Game.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def remove_player
    @player = User.find(params[:player_id])

    # This is a bit ass
    @game = Game.find(params[:id])
    @deck = @game.deck
    players_hand = @player.card_in_hands.find_all {|card| card.deck.game == @game}
    players_hand.each do |a|
      @player.cards.delete(a.card)
      discard = DiscardedCard.new(:deck => @deck, :card => a.card, :position => DiscardedCard.find_new_position(@deck))
      @deck.discarded_cards << discard
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "card_in_hands" WHERE ("card_in_hands".user_id = 1)
SELECT * FROM "cards" WHERE ("cards"."id" = 7)
SELECT * FROM "decks" WHERE ("decks".game_id = 1) LIMIT 1
DELETE FROM "card_in_hands" WHERE ("card_in_hands"."card_id" = 1 AND "card_in_hands"."user_id" = 1)
SELECT * FROM "discarded_cards" WHERE ("discarded_cards"."deck_id" = 1) ORDER BY position DESC LIMIT 1
INSERT INTO "discarded_cards" ("position", "card_id", "deck_id") VALUES(8, 7, 1)

  def new
    @game = Game.new
    @templates = Template.find_public_and_own(@user.id)
---
SELECT * FROM "templates" WHERE (public = 't' OR user_id = 1)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def create
    @game = Game.new(params[:game])
    @game.host = @user
    @game.deck = Deck.new_from_template(params[:template_id])
    respond_to do |format|
      if @game.save
---
INSERT INTO "decks" ("created_at", "updated_at", "game_id") VALUES('2010-07-22 22:20:41', '2010-07-22 22:20:41', 2)
INSERT INTO "games" ("created_at", "title", "updated_at", "host_id") VALUES('2010-07-22 22:20:41', 'Test 2', '2010-07-22 22:20:41', 1)

  def update
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def destroy
    @game = Game.find(params[:id])
    players = @game.players << @game.host
    players.each do |p|
      hand = p.card_in_hands.find_all {|card| card.deck.game == @game}
      hand.each do |a|
        p.cards.delete(a.card)
      end
      @user.save
    end
    @game.destroy
---
SELECT * FROM "games" WHERE ("games"."id" = 2)
INSERT INTO "players_games" ("user_id", "game_id") VALUES (1, 3)
SELECT * FROM "card_in_hands" WHERE ("card_in_hands".user_id = 2)
SELECT * FROM "decks" WHERE ("decks".game_id = 2) LIMIT 1
DELETE FROM "decks" WHERE "id" = 2
DELETE FROM "games" WHERE "id" = 2
DELETE FROM "players_games" WHERE game_id = 4 AND user_id IN (1)