app/controllers/games_controller.rb

  def show
    @game = Game.find(params[:id])
    @decks = @game.decks
    @current_players = @game.all_players
    @available_players = User.find(:all) - @current_players
    if(@host)
      @acts = @game.all_acts
    else
      @acts = @game.visible_acts(@user)
    end
    @acts_first_five = @acts[0..4]
    @acts_rest = @acts[5..(@acts.length)]
---
SELECT * FROM "acts" WHERE ("acts".game_id = 9)

  def change_player
    @game = Game.find(params[:id])
    new_player = User.find(params[:new_player_id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def edit
    @game = Game.find(params[:id])
    @templates = Template.find_public_and_own(@user.id)
---
SELECT * FROM "templates" WHERE (public = 't' OR user_id = 1)

  def update
    @game = Game.find(params[:id])
    @deck = Deck.new_from_template(params[:template_id])
    @game.decks << @deck
---
INSERT INTO "decks" ("name", "game_id") VALUES('Small World Races', 1)