app/controllers/plays_controller.rb

  def show
    @play = Play.find(params[:id])
    @game = Game.find(params[:game_id])
    @play_owner = User.find(@play.user)
---
SELECT * FROM "plays" WHERE ("plays"."id" = 2)
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)