app/controllers/templates_controller.rb

  def show
    @tpl = Template.find(params[:id])
---
SELECT * FROM "templates" WHERE ("templates"."id" = 4)

  def create
    @tpl = Template.new(params[:template])
    @tpl.user = @user
    if @tpl.save
---
INSERT INTO "templates" ("name", "public", "user_id") VALUES('Runewars Tactics', 'f', 1)