app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @tpls = Template.find_all_by_public(true)
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "templates" WHERE (public = 't')

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "login", "password") VALUES('2010-07-22 22:05:28', '2010-07-22 22:05:28', 'symb', 'symb')

  def authenticate
    @user = User.find_by_login_and_password(params[:user][:login], params[:user][:password])
---
SELECT * FROM "users" WHERE ("users"."password" = 'yrag55' AND "users"."login" = 'admanb') LIMIT 1